cf_billing/Catalogs/энргСхемыПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСхемыПИД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаОРП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банкротство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииДебитора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Необязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Enums/энргТипыЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыЭтапов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДосудебнаяРабота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебнаяРабота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительнаяРабота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банкротство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргСхемыПИД/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ПрошедшиеЭтапы = Новый Массив;
	
	Для каждого СтрокаТЧ Из Этапы Цикл
		Если ПрошедшиеЭтапы.Найти(СтрокаТЧ.Этап) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокСтрок = Этапы.НайтиСтроки(Новый Структура("Этап", СтрокаТЧ.Этап));
		Если СписокСтрок.Количество() > 1 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Повторяется этап " + Строка(СтрокаТЧ.Этап));
		КонецЕсли;
		
		ПрошедшиеЭтапы.Добавить(СтрокаТЧ.Этап);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ТипОРП = Перечисления.энргТипыЭтапов.ОграничениеРежимаПотребления;
	
	Если СхемаОРП Тогда
		ТекстОшибки = "Этап не относится к ОРП";
	Иначе
		ТекстОшибки = "В схему нельзя включать этапы ОРП";
	КонецЕсли;

	
	Для каждого СтрокаТЧ Из Этапы Цикл
		ТипЭтапа = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Этап, "Тип");
		
		Если (ТипЭтапа = ТипОРП) <> СхемаОРП Тогда
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,"Этапы[" + (СтрокаТЧ.НомерСтроки-1) + "].Этап", "Объект");				
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
